{"config": [{"config": {"strides": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}