{"config": [{"config": {"trainable": true, "kernel_regularizer": null, "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "name": "conv2d_1", "strides": [1, 1], "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "strides": [1, 1], "filters": 64, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 10, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.2"}