{"config": [{"config": {"units": 256, "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "name": "dense_3", "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 784], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "bias_constraint": null, "name": "dense_4", "kernel_constraint": null, "units": 10, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow"}